In [2]:
import pandas as pd
import numpy as np
import seaborn as sns

### Soal no 4

In [72]:
huruf = list('abcdefghijklmnopqrstuvwxyz')
data = pd.Series(
    range(1, len(huruf) + 1), index=huruf
)
print(data)

a     1
b     2
c     3
d     4
e     5
f     6
g     7
h     8
i     9
j    10
k    11
l    12
m    13
n    14
o    15
p    16
q    17
r    18
s    19
t    20
u    21
v    22
w    23
x    24
y    25
z    26
dtype: int64

### soal no 5

In [78]:
data = np.random.randint(1, 5, 100)
data_list = pd.Series(data)
print(data_list)

frekuensi = data_list.value_counts()
print("frekuensi setiap angka:", frekuensi)

frekuensi_tertinggi = frekuensi.head(2)
print("Dua nilai dengan frekuensi tertinggi:", frekuensi_tertinggi)

0     1
1     2
2     2
3     1
4     1
     ..
95    3
96    3
97    1
98    4
99    3
Length: 100, dtype: int32
frekuensi setiap angka: 1    35
3    25
2    22
4    18
dtype: int64
Dua nilai dengan frekuensi tertinggi: 1    35
3    25
dtype: int64

### Soal no 6

In [13]:
mpg = sns.load_dataset('mpg')

In [14]:
mpg.head(5)

,mpg,cylinders,displacement,horsepower,weight,acceleration,model_year,origin,name
0,18.0,8,307.0,130.0,3504,12.0,70,usa,chevrolet chevelle malibu
1,15.0,8,350.0,165.0,3693,11.5,70,usa,buick skylark 320
2,18.0,8,318.0,150.0,3436,11.0,70,usa,plymouth satellite
3,16.0,8,304.0,150.0,3433,12.0,70,usa,amc rebel sst
4,17.0,8,302.0,140.0,3449,10.5,70,usa,ford torino

In [15]:
mpg.describe(include='object')

       origin        name
count     398         398
unique      3         305
top       usa  ford pinto
freq      249           6

In [16]:
mpg.keys()

Index(['mpg', 'cylinders', 'displacement', 'horsepower', 'weight',
       'acceleration', 'model_year', 'origin', 'name'],
      dtype='object')